###################################################################

# Created by write_sdc on Sun Jun  1 19:25:18 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {result_flat[31]}]
set_load -pin_load 1.5 [get_ports {result_flat[30]}]
set_load -pin_load 1.5 [get_ports {result_flat[29]}]
set_load -pin_load 1.5 [get_ports {result_flat[28]}]
set_load -pin_load 1.5 [get_ports {result_flat[27]}]
set_load -pin_load 1.5 [get_ports {result_flat[26]}]
set_load -pin_load 1.5 [get_ports {result_flat[25]}]
set_load -pin_load 1.5 [get_ports {result_flat[24]}]
set_load -pin_load 1.5 [get_ports {result_flat[23]}]
set_load -pin_load 1.5 [get_ports {result_flat[22]}]
set_load -pin_load 1.5 [get_ports {result_flat[21]}]
set_load -pin_load 1.5 [get_ports {result_flat[20]}]
set_load -pin_load 1.5 [get_ports {result_flat[19]}]
set_load -pin_load 1.5 [get_ports {result_flat[18]}]
set_load -pin_load 1.5 [get_ports {result_flat[17]}]
set_load -pin_load 1.5 [get_ports {result_flat[16]}]
set_load -pin_load 1.5 [get_ports {result_flat[15]}]
set_load -pin_load 1.5 [get_ports {result_flat[14]}]
set_load -pin_load 1.5 [get_ports {result_flat[13]}]
set_load -pin_load 1.5 [get_ports {result_flat[12]}]
set_load -pin_load 1.5 [get_ports {result_flat[11]}]
set_load -pin_load 1.5 [get_ports {result_flat[10]}]
set_load -pin_load 1.5 [get_ports {result_flat[9]}]
set_load -pin_load 1.5 [get_ports {result_flat[8]}]
set_load -pin_load 1.5 [get_ports {result_flat[7]}]
set_load -pin_load 1.5 [get_ports {result_flat[6]}]
set_load -pin_load 1.5 [get_ports {result_flat[5]}]
set_load -pin_load 1.5 [get_ports {result_flat[4]}]
set_load -pin_load 1.5 [get_ports {result_flat[3]}]
set_load -pin_load 1.5 [get_ports {result_flat[2]}]
set_load -pin_load 1.5 [get_ports {result_flat[1]}]
set_load -pin_load 1.5 [get_ports {result_flat[0]}]
create_clock [get_ports clk]  -period 1.38  -waveform {0 0.69}
set_clock_uncertainty 0.069  [get_clocks clk]
set_input_delay -clock clk  0.0414  [get_ports clk]
set_input_delay -clock clk  0.0414  [get_ports rst_n]
set_input_delay -clock clk  0.0414  [get_ports start]
set_input_delay -clock clk  0.0414  [get_ports preload_valid]
set_input_delay -clock clk  0.0414  [get_ports {preload_addr[1]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_addr[0]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[7]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[6]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[5]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[4]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[3]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[2]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[1]}]
set_input_delay -clock clk  0.0414  [get_ports {preload_data[0]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[15]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[14]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[13]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[12]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[11]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[10]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[9]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[8]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[7]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[6]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[5]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[4]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[3]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[2]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[1]}]
set_input_delay -clock clk  0.0414  [get_ports {x_vector_flat[0]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[31]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[30]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[29]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[28]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[27]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[26]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[25]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[24]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[23]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[22]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[21]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[20]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[19]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[18]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[17]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[16]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[15]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[14]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[13]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[12]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[11]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[10]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[9]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[8]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[7]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[6]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[5]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[4]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[3]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[2]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[1]}]
set_output_delay -clock clk  0.0552  [get_ports {result_flat[0]}]
