# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name fast -timing {/synopsys/Nangate_FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/Liberty/CCS/NangateOpenCellLibrary_fast_ccs.lib}
create_library_set -name typical -timing {/synopsys/Nangate_FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/Liberty/CCS/NangateOpenCellLibrary_typical_ccs.lib}
create_library_set -name worst -timing {/synopsys/Nangate_FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/Liberty/CCS/NangateOpenCellLibrary_worst_low_ccs.lib}
create_constraint_mode -name synth -sdc_files {tile_pe.sdc}
create_delay_corner -name fast -library_set {fast}
create_delay_corner -name typical -library_set {typical}
create_delay_corner -name worst -library_set {worst}
create_analysis_view -name fast -constraint_mode {synth} -delay_corner {fast}
create_analysis_view -name typical -constraint_mode {synth} -delay_corner {typical}
create_analysis_view -name worst -constraint_mode {synth} -delay_corner {worst}
set_analysis_view -setup {worst} -hold {fast}
