###################################################################

# Created by write_sdc on Sun Jun  8 19:59:21 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1.5 [get_ports {x_reg_out[7]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[6]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[5]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[4]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[3]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[2]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[1]}]
set_load -pin_load 1.5 [get_ports {x_reg_out[0]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[31]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[30]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[29]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[28]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[27]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[26]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[25]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[24]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[23]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[22]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[21]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[20]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[19]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[18]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[17]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[16]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[15]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[14]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[13]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[12]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[11]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[10]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[9]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[8]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[7]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[6]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[5]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[4]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[3]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[2]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[1]}]
set_load -pin_load 1.5 [get_ports {acc_reg_out[0]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_uncertainty 0.05  [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports clk]
set_input_delay -clock clk  0.05  [get_ports rst_n]
set_input_delay -clock clk  0.05  [get_ports {core_row[3]}]
set_input_delay -clock clk  0.05  [get_ports {core_row[2]}]
set_input_delay -clock clk  0.05  [get_ports {core_row[1]}]
set_input_delay -clock clk  0.05  [get_ports {core_row[0]}]
set_input_delay -clock clk  0.05  [get_ports {core_col[3]}]
set_input_delay -clock clk  0.05  [get_ports {core_col[2]}]
set_input_delay -clock clk  0.05  [get_ports {core_col[1]}]
set_input_delay -clock clk  0.05  [get_ports {core_col[0]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[7]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[6]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[5]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[4]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[3]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[2]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[1]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_addr[0]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[7]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[6]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[5]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[4]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[3]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[2]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[1]}]
set_input_delay -clock clk  0.05  [get_ports {cfg_data[0]}]
set_input_delay -clock clk  0.05  [get_ports cfg_valid]
set_input_delay -clock clk  0.05  [get_ports {global_state[1]}]
set_input_delay -clock clk  0.05  [get_ports {global_state[0]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[7]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[6]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[5]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[4]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[3]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[2]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[1]}]
set_input_delay -clock clk  0.05  [get_ports {x_in[0]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[31]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[30]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[29]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[28]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[27]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[26]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[25]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[24]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[23]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[22]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[21]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[20]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[19]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[18]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[17]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[16]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[15]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[14]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[13]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[12]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[11]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[10]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[9]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[8]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[7]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[6]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[5]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[4]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[3]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[2]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[1]}]
set_input_delay -clock clk  0.05  [get_ports {acc_in[0]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[7]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[6]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[5]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[4]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[3]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[2]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[1]}]
set_output_delay -clock clk  0.05  [get_ports {x_reg_out[0]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[31]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[30]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[29]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[28]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[27]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[26]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[25]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[24]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[23]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[22]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[21]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[20]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[19]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[18]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[17]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[16]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[15]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[14]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[13]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[12]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[11]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[10]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[9]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[8]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[7]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[6]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[5]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[4]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[3]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[2]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[1]}]
set_output_delay -clock clk  0.05  [get_ports {acc_reg_out[0]}]
